p2p-bench/results/run5/scenarios/simple_p2p_on-c4/run_1.stdout.txt
WARNING 06-27 03:18:40 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70e355a58360>, trust_remote_code=False, seed=1234, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='simple_p2p_on-c4', input_len=None, output_len=None, tokenizer='/data/models/Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run5/scenarios/simple_p2p_on-c4', result_filename='run_1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-ad30bdb1-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-27 03:18:44 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  1160.00   
Total input tokens:                      262144    
Total generated tokens:                  131072    
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         112.99    
Peak output token throughput (tok/s):    60.00     
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          338.98    
---------------Time to First Token----------------
Mean TTFT (ms):                          8499.81   
Median TTFT (ms):                        7788.39   
P50 TTFT (ms):                           7788.39   
P90 TTFT (ms):                           13299.05  
P99 TTFT (ms):                           16904.05  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.04     
Median TPOT (ms):                        29.89     
P50 TPOT (ms):                           29.89     
P90 TPOT (ms):                           39.21     
P99 TPOT (ms):                           50.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           99.93     
Median ITL (ms):                         67.92     
P50 ITL (ms):                            67.92     
P90 ITL (ms):                            68.45     
P99 ITL (ms):                            72.94     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          72036.59  
Median E2EL (ms):                        68971.13  
P50 E2EL (ms):                           68971.13  
P90 E2EL (ms):                           91379.61  
P99 E2EL (ms):                           110251.77 
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:54<06:19, 54.23s/it]
 38%|███▊      | 3/8 [01:05<01:31, 18.20s/it]
 50%|█████     | 4/8 [01:10<00:54, 13.71s/it]
 62%|██████▎   | 5/8 [01:52<01:09, 23.11s/it]
 75%|███████▌  | 6/8 [01:53<00:31, 15.84s/it]
 88%|████████▊ | 7/8 [01:59<00:12, 12.83s/it]
100%|██████████| 8/8 [02:06<00:00, 11.06s/it]
100%|██████████| 8/8 [02:06<00:00, 15.83s/it]

  0%|          | 0/64 [00:00<?, ?it/s]
  2%|▏         | 1/64 [00:53<56:39, 53.95s/it]
  3%|▎         | 2/64 [00:59<26:08, 25.30s/it]
  5%|▍         | 3/64 [01:13<20:47, 20.45s/it]
  6%|▋         | 4/64 [01:22<15:38, 15.65s/it]
  8%|▊         | 5/64 [01:55<21:31, 21.88s/it]
  9%|▉         | 6/64 [02:07<18:06, 18.73s/it]
 11%|█         | 7/64 [02:23<16:44, 17.62s/it]
 12%|█▎        | 8/64 [02:35<14:53, 15.95s/it]
 14%|█▍        | 9/64 [03:04<18:17, 19.96s/it]
 16%|█▌        | 10/64 [03:21<17:21, 19.29s/it]
 17%|█▋        | 11/64 [03:31<14:21, 16.25s/it]
 19%|█▉        | 12/64 [03:56<16:21, 18.87s/it]
 20%|██        | 13/64 [04:19<17:06, 20.14s/it]
 22%|██▏       | 14/64 [04:39<16:43, 20.07s/it]
 23%|██▎       | 15/64 [04:49<13:52, 16.98s/it]
 25%|██▌       | 16/64 [05:18<16:41, 20.87s/it]
 27%|██▋       | 17/64 [05:35<15:19, 19.56s/it]
 28%|██▊       | 18/64 [05:45<12:46, 16.67s/it]
 30%|██▉       | 19/64 [05:56<11:10, 14.91s/it]
 31%|███▏      | 20/64 [06:32<15:34, 21.24s/it]
 33%|███▎      | 21/64 [06:45<13:25, 18.74s/it]
 36%|███▌      | 23/64 [07:10<10:50, 15.85s/it]
 38%|███▊      | 24/64 [07:38<12:34, 18.86s/it]
 39%|███▉      | 25/64 [08:00<12:56, 19.90s/it]
 41%|████      | 26/64 [08:18<12:08, 19.18s/it]
 44%|████▍     | 28/64 [08:44<09:53, 16.48s/it]
 45%|████▌     | 29/64 [09:09<10:52, 18.65s/it]
 47%|████▋     | 30/64 [09:24<09:57, 17.56s/it]
 48%|████▊     | 31/64 [09:49<10:45, 19.55s/it]
 50%|█████     | 32/64 [09:57<08:46, 16.47s/it]
 52%|█████▏    | 33/64 [10:22<09:46, 18.91s/it]
 53%|█████▎    | 34/64 [10:33<08:15, 16.51s/it]
 55%|█████▍    | 35/64 [11:03<09:54, 20.49s/it]
 56%|█████▋    | 36/64 [11:21<09:12, 19.73s/it]
 58%|█████▊    | 37/64 [11:32<07:44, 17.21s/it]
 59%|█████▉    | 38/64 [11:53<08:00, 18.48s/it]
 61%|██████    | 39/64 [12:08<07:15, 17.42s/it]
 62%|██████▎   | 40/64 [12:30<07:31, 18.81s/it]
 64%|██████▍   | 41/64 [12:49<07:12, 18.81s/it]
 66%|██████▌   | 42/64 [13:13<07:26, 20.29s/it]
 67%|██████▋   | 43/64 [13:24<06:09, 17.60s/it]
 69%|██████▉   | 44/64 [13:36<05:16, 15.84s/it]
 70%|███████   | 45/64 [14:09<06:39, 21.04s/it]
 72%|███████▏  | 46/64 [14:26<05:54, 19.72s/it]
 73%|███████▎  | 47/64 [14:34<04:38, 16.37s/it]
 75%|███████▌  | 48/64 [14:48<04:10, 15.68s/it]
 77%|███████▋  | 49/64 [15:15<04:43, 18.93s/it]
 78%|███████▊  | 50/64 [15:33<04:22, 18.72s/it]
 80%|███████▉  | 51/64 [15:47<03:43, 17.17s/it]
 81%|████████▏ | 52/64 [15:57<02:59, 14.95s/it]
 83%|████████▎ | 53/64 [16:32<03:52, 21.16s/it]
 84%|████████▍ | 54/64 [16:51<03:24, 20.43s/it]
 86%|████████▌ | 55/64 [17:00<02:32, 16.99s/it]
 88%|████████▊ | 56/64 [17:19<02:21, 17.74s/it]
 89%|████████▉ | 57/64 [17:38<02:06, 18.13s/it]
 91%|█████████ | 58/64 [18:10<02:12, 22.07s/it]
 92%|█████████▏| 59/64 [18:30<01:47, 21.51s/it]
 94%|█████████▍| 60/64 [18:41<01:13, 18.29s/it]
 95%|█████████▌| 61/64 [19:02<00:57, 19.19s/it]
 97%|█████████▋| 62/64 [19:08<00:30, 15.28s/it]
 98%|█████████▊| 63/64 [19:19<00:14, 14.09s/it]
100%|██████████| 64/64 [19:19<00:00, 18.12s/it]